#include "ForTheGame.hpp"

void ForTheGame::MainMenu()
{
	std::cout << " ===========================================================================\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                           *ANIMAL-CANNIBAL*                           ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                      __    __    __    __                             ||\n";
	std::cout << " ||                     /  \\  /  \\  /  \\  /  \\                            ||\n";
	std::cout << " ||____________________/  __\\/  __\\/  __\\/  __\\___________________________||\n";
	std::cout << " ||___________________/  /__/  /__/  /__/  /______________________________||\n";
	std::cout << " ||                   | / \\   / \\   / \\   / \\  \\____                      ||\n";
	std::cout << " ||                   |/   \\_/   \\_/   \\_/   \\    o \\                     ||\n";
	std::cout << " ||                                           \\_____/--<                  ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                              *Меню*                                   ||\n";
	std::cout << " ||					                                  ||\n";
	std::cout << " ||                         -> 1. Начать играть                           ||\n";
	std::cout << " ||                         -> 2. Инструкция                              ||\n";
	std::cout << " ||                         -> 3. Авторы                                  ||\n";
	std::cout << " ||                         -> 4. Выход                                   ||\n";
	std::cout << " ||				                                          ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ===========================================================================\n";
}

void ForTheGame::ChooseTheLevel()
{
	std::cout << " ===========================================================================\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                           ***Выберите уровень***                      ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                            ____                       ||\n";
	std::cout << " ||                   ________________________/ O  \\___/                  ||\n";
	std::cout << " ||                 /_____________________________/    \\                  ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                   -> 1. Первый уровень (легкий)                       ||\n";
	std::cout << " ||                   -> 2. Второй уровень (сложный)                      ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ===========================================================================\n";
}

void ForTheGame::GameIsOver01()
{
	std::cout << " ===========================================================================\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||           ____    _    __  __ _____ _____     _______ ____            ||\n";
	std::cout << " ||          / ___|  / \\  |  \\/  | ____/ _ \\ \\   / / ____|  _ \\           ||\n";
	std::cout << " ||         | |  _  / _ \\ | |\\/| |  _|| | | \\ \\ / /|  _| | |_) |          ||\n";
	std::cout << " ||         | |_| |/ ___ \\| |  | | |__| |_| |\\ V / | |___|  _ <           ||\n";
	std::cout << " ||          \\____/_/   \\_\\_|  |_|_____\\___/  \\_/  |_____|_| \\_\\          ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                       ВЫ ВРЕЗАЛИСЬ В СТЕНУ                            ||\n";
	std::cout << " ||                         ВЫ ПРОИГРАЛИ!Т ^ T                            ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                    HOW MANY APPLES DO YOU EAT: " << counter << "                     ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                            ПОКА-ПОКА ^^                               ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                НАЖМИТЕ ЛЮБУЮ КНОПОЧКУ ЧТОБ ВЕРНУТЬСЯ                  ||\n";
	std::cout << " ||                              В МЕНЮ                                   ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ===========================================================================\n";
}

void ForTheGame::GameIsOver02()
{
	std::cout << " ===========================================================================\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||           ____    _    __  __ _____ _____     _______ ____            ||\n";
	std::cout << " ||          / ___|  / \\  |  \\/  | ____/ _ \\ \\   / / ____|  _ \\           ||\n";
	std::cout << " ||         | |  _  / _ \\ | |\\/| |  _|| | | \\ \\ / /|  _| | |_) |          ||\n";
	std::cout << " ||         | |_| |/ ___ \\| |  | | |__| |_| |\\ V / | |___|  _ <           ||\n";
	std::cout << " ||          \\____/_/   \\_\\_|  |_|_____\\___/  \\_/  |_____|_| \\_\\          ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                        ВЫ ВРЕЗАЛИСЬ В СЕБЯ                            ||\n";
	std::cout << " ||                         ВЫ ПРОИГРАЛИ!Т ^ T                            ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                    HOW MANY APPLES DO YOU EAT: " << counter << "                     ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                            ПОКА-ПОКА ^^                               ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                НАЖМИТЕ ЛЮБУЮ КНОПОЧКУ ЧТОБ ВЕРНУТЬСЯ                  ||\n";
	std::cout << " ||                              В МЕНЮ                                   ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ===========================================================================\n";
}

void ForTheGame::GameIsOver03()
{
	std::cout << " ===========================================================================\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||           ____    _    __  __ _____ _____     _______ ____            ||\n";
	std::cout << " ||          / ___|  / \\  |  \\/  | ____/ _ \\ \\   / / ____|  _ \\           ||\n";
	std::cout << " ||         | |  _  / _ \\ | |\\/| |  _|| | | \\ \\ / /|  _| | |_) |          ||\n";
	std::cout << " ||         | |_| |/ ___ \\| |  | | |__| |_| |\\ V / | |___|  _ <           ||\n";
	std::cout << " ||          \\____/_/   \\_\\_|  |_|_____\\___/  \\_/  |_____|_| \\_\\          ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                        ВЫ ВЫШЛИ ИЗ ИГРЫ                               ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                            ПОКА-ПОКА ^^                               ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                НАЖМИТЕ ЛЮБУЮ КНОПОЧКУ ЧТОБ ВЕРНУТЬСЯ                  ||\n";
	std::cout << " ||                              В МЕНЮ                                   ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ===========================================================================\n";
}

void ForTheGame::GameIsOver04()
{
	std::cout << " ===========================================================================\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||           ____    _    __  __ _____ _____     _______ ____            ||\n";
	std::cout << " ||          / ___|  / \\  |  \\/  | ____/ _ \\ \\   / / ____|  _ \\           ||\n";
	std::cout << " ||         | |  _  / _ \\ | |\\/| |  _|| | | \\ \\ / /|  _| | |_) |          ||\n";
	std::cout << " ||         | |_| |/ ___ \\| |  | | |__| |_| |\\ V / | |___|  _ <           ||\n";
	std::cout << " ||          \\____/_/   \\_\\_|  |_|_____\\___/  \\_/  |_____|_| \\_\\          ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                        ВЫ ВРЕЗАЛИСЬ ВО ВРАГА                          ||\n";
	std::cout << " ||                          ВЫ ПРОИГРАЛИ!Т ^ T                           ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                    HOW MANY APPLES DO YOU EAT: " << counter << "                     ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                            ПОКА-ПОКА ^^                               ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                НАЖМИТЕ ЛЮБУЮ КНОПОЧКУ ЧТОБ ВЕРНУТЬСЯ                  ||\n";
	std::cout << " ||                              В МЕНЮ                                   ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ===========================================================================\n";
}

void ForTheGame::Instructions()
{
	std::cout << " ===========================================================================\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                           ***Инструкция***                            ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                            ____                       ||\n";
	std::cout << " ||                   ________________________/ O  \\___/                  ||\n";
	std::cout << " ||                 /_____________________________/    \\                  ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||             1. W,A,S,D - управление змеёй.                            ||\n";
	std::cout << " ||             2. Кушайте и растите! Каждый съеденный фрукт -            ||\n";
	std::cout << " ||                это десять очков.                                      ||\n";
	std::cout << " ||             3. Если змея врежется в себя или стену,                   ||\n";
	std::cout << " ||                то вы проиграли!                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                НАЖМИТЕ ЛЮБУЮ КНОПОЧКУ ЧТОБ ВЕРНУТЬСЯ                  ||\n";
	std::cout << " ||                                 В МЕНЮ                                ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ===========================================================================\n";
}

void ForTheGame::InstructionsLevelOne()
{
	std::cout << " ===========================================================================\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                           ***Инструкция***                            ||\n";
	std::cout << " ||                            ***Уровень1***                             ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                            ____                       ||\n";
	std::cout << " ||                   ________________________/ O  \\___/                  ||\n";
	std::cout << " ||                 /_____________________________/    \\                  ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||             1. Кушайте и ростите.                                     ||\n";
	std::cout << " ||             2. Главное - не врезайтесь в себя!                        ||\n";
	std::cout << " ||             3. Удачи!!!!!                                             ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                НАЖМИТЕ ЛЮБУЮ КНОПОЧКУ ЧТОБ ВЕРНУТЬСЯ                  ||\n";
	std::cout << " ||                                 В МЕНЮ                                ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ===========================================================================\n";
}

void ForTheGame::InstructionsLevelTwo()
{
	std::cout << " ===========================================================================\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                           ***Инструкция***                            ||\n";
	std::cout << " ||                            ***Уровень2***                             ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                            ____                       ||\n";
	std::cout << " ||                   ________________________/ O  \\___/                  ||\n";
	std::cout << " ||                 /_____________________________/    \\                  ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||             1. Кушайте и ростите.                                     ||\n";
	std::cout << " ||             2. Главное - не врезайтесь в себя и стены!                ||\n";
	std::cout << " ||             3. Остерегайтесь врагов.                                  ||\n";
	std::cout << " ||             4. Удачи!!!!!                                             ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                НАЖМИТЕ ЛЮБУЮ КНОПОЧКУ ЧТОБ ВЕРНУТЬСЯ                  ||\n";
	std::cout << " ||                                 В МЕНЮ                                ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ===========================================================================\n";
}

void ForTheGame::Credits()
{
	std::cout << " ===========================================================================\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                               *Авторы*                                ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                      Сделали какие-то мужики,                         ||\n";
	std::cout << " ||                         а я это украла :)))                           ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                  )             (      (      (      (                 ||\n";
	std::cout << " ||               ( /(     (       )\\ )   )\\ )   )\\ )   )\\ )              ||\n";
	std::cout << " ||               )\\())    )\\     (()/(  (()/(  (()/(  (()/(              ||\n";
	std::cout << " ||              ((_)\\  ((((_)(    /(_))  /(_))  /(_))  /(_))             ||\n";
	std::cout << " ||               _((_)  )\\ _ )\\  (_))   (_))   (_))   (_))               ||\n";
	std::cout << " ||              | || |  (_)_\\(_) | _ \\  | _ \\  |_ _|  / __|              ||\n";
	std::cout << " ||              | __ |   / _ \\   |   /  |   /   | |   \\__ \\              ||\n";
	std::cout << " ||              |_||_|  /_/ \\_\\  |_|_\\  |_|_\\  |___|  |___/              ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ||                НАЖМИТЕ ЛЮБУЮ КНОПОЧКУ ЧТОБ ВЕРНУТЬСЯ                  ||\n";
	std::cout << " ||                                 В МЕНЮ                                ||\n";
	std::cout << " ||                                                                       ||\n";
	std::cout << " ===========================================================================\n";
}
